In [1]:
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [2]:
data= pd.read_csv("Salary.csv")

In [3]:
data.head()

   Years Of Experience  Salary
0                  1.1   39343
1                  1.3   46205
2                  1.5   37731
3                  2.0   43525
4                  2.2   39891

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Years Of Experience  35 non-null     float64
 1   Salary               35 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 688.0 bytes

In [5]:
data.count()

Years Of Experience    35
Salary                 35
dtype: int64

In [6]:
data.describe()

       Years Of Experience         Salary
count            35.000000      35.000000
mean              6.308571   83945.600000
std               3.618610   32162.673003
min               1.100000   37731.000000
25%               3.450000   57019.000000
50%               5.300000   81363.000000
75%               9.250000  113223.500000
max              13.500000  139465.000000

In [7]:
data.columns

Index(['Years Of Experience', 'Salary'], dtype='object')

In [8]:
X=data['Years Of Experience'].values
X

array([ 1.1,  1.3,  1.5,  2. ,  2.2,  2.9,  3. ,  3.2,  3.2,  3.7,  3.9,
        4. ,  4. ,  4.1,  4.5,  4.9,  5.1,  5.3,  5.9,  6. ,  6.8,  7.1,
        7.9,  8.2,  8.7,  9. ,  9.5,  9.6, 10.3, 10.5, 11.2, 11.5, 12.3,
       12.9, 13.5])

In [9]:
Y=data['Salary'].values
Y

array([ 39343,  46205,  37731,  43525,  39891,  56642,  60150,  54445,
        64445,  57189,  63218,  55794,  56957,  57081,  61111,  67938,
        66029,  83088,  81363,  93940,  91738,  98273, 101302, 113812,
       109431, 105582, 116969, 112635, 122391, 121872, 127345, 126756,
       128765, 135675, 139465], dtype=int64)

In [15]:
from sklearn.model_selection import train_test_split
train_set, test_set= train_test_split(data, test_size=0.2,random_state=42)
test_set, train_set= len(test_set), len(train_set)
test_set

7

train_set